# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [25]:
import pandas as pd
# Create dataframe
data = {'Company':['Google','Google','MS','MS','Meta','Meta'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [26]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0  Google      Sam    200
1  Google  Charlie    120
2      MS      Amy    340
3      MS  Vanessa    124
4    Meta     Carl    243
5    Meta    Sarah    350

<strong>Now you can use the .groupby() method to group rows together based off of a column name.<br>For instance let's group based off of Company. This will create a DataFrameGroupBy object:</strong>

In [27]:
# normally a latest version of pandas can show the result of groupby directly (without using ['Sales'])
df.groupby('Company')['Sales'].mean()

Company
Google    160.0
MS        232.0
Meta      296.5
Name: Sales, dtype: float64

You can save this object as a new variable:

In [33]:
by_comp = df.groupby("Company")['Sales']

And then call aggregate methods off the object:

In [34]:
by_comp.mean()

Company
Google    160.0
MS        232.0
Meta      296.5
Name: Sales, dtype: float64

In [36]:
df.groupby('Company')['Sales'].mean()

Company
Google    160.0
MS        232.0
Meta      296.5
Name: Sales, dtype: float64

More examples of aggregate methods:

In [37]:
by_comp.std()

Company
Google     56.568542
MS        152.735065
Meta       75.660426
Name: Sales, dtype: float64

In [39]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [40]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [41]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [42]:
by_comp.describe()

                    Sales
Company
FB      count    2.000000
        mean   296.500000
        std     75.660426
        min    243.000000
        25%    269.750000
        50%    296.500000
        75%    323.250000
        max    350.000000
GOOG    count    2.000000
        mean   160.000000
        std     56.568542
        min    120.000000
        25%    140.000000
        50%    160.000000
        75%    180.000000
        max    200.000000
MSFT    count    2.000000
        mean   232.000000
        std    152.735065
        min    124.000000
        25%    178.000000
        50%    232.000000
        75%    286.000000
        max    340.000000

In [43]:
by_comp.describe().transpose()

Company    FB                                                         GOOG  \
        count   mean        std    min     25%    50%     75%    max count
Sales     2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0   2.0

Company         ...                  MSFT                                   \
          mean  ...      75%    max count   mean         std    min    25%
Sales    160.0  ...    180.0  200.0   2.0  232.0  152.735065  124.0  178.0

Company
           50%    75%    max
Sales    232.0  286.0  340.0

[1 rows x 24 columns]

In [44]:
by_comp.describe().transpose()['GOOG']

       count   mean        std    min    25%    50%    75%    max
Sales    2.0  160.0  56.568542  120.0  140.0  160.0  180.0  200.0